test/artillery.yml
# socket.io로 30초 동안 테스트를 진행합니다.
# 
config:
  target: "http://localhost:9014"     # 테스트가 진행될 URI
  socketio:                           # socket.io로 테스트한다는 뜻
    transports: ["websocket"]
  phases:                             # 해당 기간 동안 몇 명의 가상 유저가 생성되는지
    - duration: 1                     # 테스트가 진행되는 시간 (초 단위)
      arrivalRate: 1                  # 매 초 생성되는 가상 유저의 수
        
scenarios:
  - engine: "socketio"
    flow:
      - emit:
          channel: "save_msg"
          data: { 
            "token": "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZHgiOjMsImlkIjoiMzQ1N3Nvc28iLCJuaWNrbmFtZSI6InNveW91bmciLCJhdmF0YXIiOiJodHRwczovL2VuY3J5cHRlZC10Ym4wLmdzdGF0aWMuY29tL2ltYWdlcz9xPXRibjpBTmQ5R2NROGpETVMxTW5jSmc2LVBkUVI1Z3pwVGloZDRxa0w5dWZETkExMzN6UTN0R2FLVzAyWCIsImlhdCI6MTUzNTgyOTU4MywiZXhwIjoxNTM1ODcyNzgzfQ.Va1zlCGwGDTJi2jo-_A8wdymzgKhMUnmI88mPuWefto", 
            "messageData": {
              "lng": 127.101768,
              "lat": 37.590039,
              "contents": "testing",
              "type": "LoudSpeaker"
            },
            "radius": 500,
            "testing": true
          }
      - think: 1